app/controllers/users_controller.rb

  def show
  	if(logged_in)
   		@posts = User.find(@user.id).posts
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "name", "birthdate", "created_at", "updated_at", "address", "postal_code", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "b"], ["updated_at", "2021-10-06 14:27:19.375634"], ["id", 4]]

  def destroy
    session[:user_id] = nil
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]

  def create_fast
    @name = params[:name]
    @email = params[:email]
    User.create( name: @name, email: @email)
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "adasd"], ["name", "xxx"], ["created_at", "2021-09-09 08:27:30.691933"], ["updated_at", "2021-09-09 08:27:30.691933"]]

  def check_login
	@loginEmail = params[:email]
	@loginPassword = params[:password]
	@usermatch = false
	@find = User.find_by(email:@loginEmail)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user1"], ["LIMIT", 1]]

  def add_post
  	@post = Post.new(post_params)
	if @post.save
---
INSERT INTO "posts" ("user_id", "msg", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["msg", "a"], ["created_at", "2021-10-06 14:34:46.169672"], ["updated_at", "2021-10-06 14:34:46.169672"]]

  def edit_post_page
  	@user = User.find(params[:user_id])
	@post = @user.posts.find(params[:post_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 15], ["LIMIT", 1]]

  def update_post
  	@user = User.find(params[:user_id])
  	@post = @user.posts.find(params[:post_id])
  	@post.update(post_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "msg" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["msg", "u1p1"], ["updated_at", "2021-10-06 14:33:53.545350"], ["id", 1]]

  def delete_post_page
  	@user = User.find(params[:user_id])
  	@post = @user.posts.find(params[:post_id])
  	@post.destroy()
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 4], ["id", 17], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 17]]