app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def check_login
	@loginEmail = params[:email]
	@loginPassword = params[:password]
	@users = User.all
	@usermatch = false
	@users.each do |checkuser|

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit_post_page
  	@user = User.find(params[:user_id])